{
    "currentUser": {
        "uid": "MN0zncdpcxdM8CzwDqv6DxaoL4n2"
    },
    "galleryPhotos": [
        {
            "url": "https://firebasestorage.googleapis.com/v0/b/mvo-db-48e9d.appspot.com/o/MN0zncdpcxdM8CzwDqv6DxaoL4n2%2Fgallery-photos%2F4.JPG?alt=media&token=07a83a9e-556f-46b3-90a8-ea343b7cc7bc"
        },
        {
            "url": "https://firebasestorage.googleapis.com/v0/b/mvo-db-48e9d.appspot.com/o/MN0zncdpcxdM8CzwDqv6DxaoL4n2%2Fgallery-photos%2F2.JPEG?alt=media&token=8a562a5a-6040-4287-bc46-81c02dd074b6"
        },
        {
            "url": "https://firebasestorage.googleapis.com/v0/b/mvo-db-48e9d.appspot.com/o/MN0zncdpcxdM8CzwDqv6DxaoL4n2%2Fgallery-photos%2F3.jpg?alt=media&token=17820cef-e345-4c77-958b-8c1b96bc6573"
        },
        {
            "url": "https://firebasestorage.googleapis.com/v0/b/mvo-db-48e9d.appspot.com/o/MN0zncdpcxdM8CzwDqv6DxaoL4n2%2Fgallery-photos%2F0.JPG?alt=media&token=e2f160bf-0fca-4d5a-98e0-6e640d88c496"
        },
        {
            "url": "https://firebasestorage.googleapis.com/v0/b/mvo-db-48e9d.appspot.com/o/MN0zncdpcxdM8CzwDqv6DxaoL4n2%2Fgallery-photos%2F5.JPG?alt=media&token=a1a6d3f1-5b1f-48ae-9f65-f810014128dc"
        },
        {
            "url": "https://firebasestorage.googleapis.com/v0/b/mvo-db-48e9d.appspot.com/o/MN0zncdpcxdM8CzwDqv6DxaoL4n2%2Fgallery-photos%2F1.JPG?alt=media&token=13511bc4-4167-4b17-a060-5118d2e0858a"
        },
        {
            "url": "https://firebasestorage.googleapis.com/v0/b/mvo-db-48e9d.appspot.com/o/MN0zncdpcxdM8CzwDqv6DxaoL4n2%2Fgallery-photos%2F8?alt=media&token=8d5b878c-fb21-4331-9bdb-8c8dfa5fa4ac"
        },
        {
            "url": "https://firebasestorage.googleapis.com/v0/b/mvo-db-48e9d.appspot.com/o/MN0zncdpcxdM8CzwDqv6DxaoL4n2%2Fgallery-photos%2F6.JPG?alt=media&token=338f1149-ae08-4bd5-9a10-8134d9ca2f01"
        },
        {
            "url": "https://firebasestorage.googleapis.com/v0/b/mvo-db-48e9d.appspot.com/o/MN0zncdpcxdM8CzwDqv6DxaoL4n2%2Fgallery-photos%2F7?alt=media&token=0354b709-5ee1-49e5-8ce2-2c0fcc404e19"
        }
    ],
    "galleryVideos": [
        {
            "url": "https://firebasestorage.googleapis.com/v0/b/mvo-db-48e9d.appspot.com/o/MN0zncdpcxdM8CzwDqv6DxaoL4n2%2Fgallery-videos%2Fbfc0072229094df0adb0fc6d1c4a6888.MOV?alt=media&token=bfad70c2-dc31-4903-8b4d-f006c430f539"
        },
        {
            "url": "https://firebasestorage.googleapis.com/v0/b/mvo-db-48e9d.appspot.com/o/MN0zncdpcxdM8CzwDqv6DxaoL4n2%2Fgallery-videos%2Fvideo_8666e54eb5f34c55ae787427447094eb.MP4?alt=media&token=a19e598d-5ace-487d-9d55-a15996d03367"
        },
        {
            "url": "https://firebasestorage.googleapis.com/v0/b/mvo-db-48e9d.appspot.com/o/MN0zncdpcxdM8CzwDqv6DxaoL4n2%2Fgallery-videos%2Ff9169ef6694f47f49ba046b17c279ecc.MOV?alt=media&token=c9da8246-a7f0-49b3-9862-377434ca95af"
        },
        {
            "url": "https://firebasestorage.googleapis.com/v0/b/mvo-db-48e9d.appspot.com/o/MN0zncdpcxdM8CzwDqv6DxaoL4n2%2Fgallery-videos%2Fvideo_425e704a37ee48d2be284069c379cf2b.MP4?alt=media&token=8f557884-2664-45da-acdd-5980d7753205"
        }
    ],
    "profilePhotos": [
        {
            "url": "https://firebasestorage.googleapis.com/v0/b/mvo-db-48e9d.appspot.com/o/MN0zncdpcxdM8CzwDqv6DxaoL4n2%2Fprofile-photos%2F2.JPG?alt=media&token=87a70dc1-bc57-46a2-994c-ea6dd7add246"
        },
        {
            "url": "https://firebasestorage.googleapis.com/v0/b/mvo-db-48e9d.appspot.com/o/MN0zncdpcxdM8CzwDqv6DxaoL4n2%2Fprofile-photos%2F0.JPG?alt=media&token=683427f7-aa2d-49f1-ba3a-1798bf6ba3d5"
        },
        {
            "url": "https://firebasestorage.googleapis.com/v0/b/mvo-db-48e9d.appspot.com/o/MN0zncdpcxdM8CzwDqv6DxaoL4n2%2Fprofile-photos%2F1.jpg?alt=media&token=6acf5de4-a4b0-419d-9f84-ab7517742eff"
        },
        {
            "url": "https://firebasestorage.googleapis.com/v0/b/mvo-db-48e9d.appspot.com/o/MN0zncdpcxdM8CzwDqv6DxaoL4n2%2Fprofile-photos%2F4.JPG?alt=media&token=360e7a12-09b4-43bc-9805-6856fb482d63"
        },
        {
            "url": "https://firebasestorage.googleapis.com/v0/b/mvo-db-48e9d.appspot.com/o/MN0zncdpcxdM8CzwDqv6DxaoL4n2%2Fprofile-photos%2F3.HEIC?alt=media&token=168efb0f-153c-4a99-b86c-f9c088b4658c"
        }
    ],
    "user_data": {
        "dob": "April 28, 1949",
        "dod": "October 11, 2021",
        "firstName": "Theresa",
        "lastName": "Morales"
    },
    "user_story": {
        "obituary": "It is with much sorrow and much love that we mourn the passing of  Theresa Ramirez Morales, of Houston, Texas, on Monday, October 11,  2021, the feast of the Maternity of the Blessed Virgin Mary, during  the month of the Most Holy Rosary at the age of 72 years. Theresa  was born to Ignacio and Ophelia Ramirez in Houston, Texas on April  28, 1949 as the second eldest of fifteen children. Theresa graduated  from high school at Incarnate Word Academy and went on to earn a  Master of Arts in Pastoral Studies from the University of St.  Thomas. As a young, smart, and beautiful Hispanic woman in the  1970s, Theresa began a successful career in the engineering  profession as a Designer, working for Brown and Root Industrial  Services, Bechtel Corporation, ABB Automation Company, and Saulsbury  Industries. A second career and great passion of hers was working in  the Lord’s vineyard, serving as Director of Religious Education at  St. Anthony of Padua Catholic Church in Palacios, Texas; St. Theresa  Catholic Church in Sugar Land, Texas; and Sacred Heart Catholic  Church in Richmond, Texas. Theresa was happily united in the  Sacrament of Holy Matrimony to Roosevelt Ybarra Morales, the love of  her life and her high school sweetheart, on April 12, 1969, and they  built an exceptionally fulfilling and fruitful life together for  fifty-two years. It is difficult to describe a jewel as multifaceted  as Theresa. She was a joyful, strong and brilliant God-fearing woman  who brought the light and warmth of God wherever she went. Whether  she was walking into a family gathering or into a CCE building to  share God’s love with children, Theresa lit up the room with her  radiant smile, cheerful laughter, and her loving presence. She was  deeply dedicated to living out and sharing her Catholic faith.  Theresa loved to pray the Rosary and to teach others how to pray it  and to consecrate themselves to Jesus through Mary. Many people went  to Theresa for prayer and life advice, looking to her as a prayer  warrior, guide, mentor, confidant, and role model as a wife, mother,  and friend. During her upbringing, Theresa developed a great  appreciation for religious music through the Catholic education she  received. She also had a passion for reading, singing, and dancing  with her loved ones, especially with her darling Roosevelt. She loved being near the water, taking in God’s beauty with her family,  while feeling the wind in her hair, the sand and water between her  toes, and hearing the waves. One of her many ways of showing love  was cooking unforgettable dishes for her family and friends. From  making Morales family-favorites, such as ‘mucho macho taco salad’  and ‘jello cake’ for birthday celebrations to hand-peeling dozens of  apples to bake homemade pies for people in need, Theresa made people  feel loved with her cooking. We will always remember the love she  poured into the holidays: whipping up Grandma Josephine Morales’  corn bread stuffing for Thanksgiving to spending days in the kitchen  laboring to create traditional Mexican molé from scratch and  hand-rolling hundreds of tamales with her Morales family during the  Christmas season, Theresa used her talents, and even more so, her  love, to bring happiness and comfort to everyone she cooked for. She  is preceded in death by her four precious babies in Heaven: Robert  Jeremiah, Ephraim Jabez, Nephtali Meshach, Elijah Caleb; several  precious grand babies; her parents Ignacio and Ophelia Ramirez; her  brother Ignacio (Nacho) Ramirez; and her brother-in-law, Michael  Lara. She is cherished by countless loved ones on Earth, especially  by her loving and devoted husband, Roosevelt Ybarra Morales; her  children, Roosevelt Sean, Marie Claudine (Carlos Aguirre), Phillip  Damian (Alyssa), Michael Dominic (Lisa), Mark Vincent (Marta), James  Stephen, Joshua Paul (Maria), Elizabeth Anne, Kathryn Alicia (Nick  Flores), Timothy Daniel, and Joseph Xavier; her 24 grandchildren;  and 2 great-grandchildren. She also is beloved by her Ramirez  family, M. Alice Martinez (Miguel), Richard L. Ramirez (Connie),  Michael J. Ramirez (Patricia), John P. Ramirez (Mary), M. Margaret  Askandari (Khosrow), Elizabeth A. Petry (Tony), Marie D. Mihealsick  (John), Anita Rodriguez (Reynaldo), Albert L. Ramirez, Nancy L.  Lara, Eugene Ramirez (Maria), Jeanette Gomez (Mike), and Christina  G. Ramirez; and her cherished nieces and nephews."
    }
}